app/controllers/admin/plans_controller.rb

  def index
    @plans = Plan.all
---
SELECT "plans".* FROM "plans"

  def create
    @plan = Plan.new(plan_params)

    if @plan.save
---
INSERT INTO "plans" ("days", "name", "profit", "penalty", "plan_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["days", 90], ["name", "Plan One"], ["profit", 10], ["penalty", 8], ["plan_type", 0], ["created_at", "2022-07-04 10:52:36.199688"], ["updated_at", "2022-07-04 10:52:36.199688"]]

  def update
    if @plan.update(plan_params)
---
UPDATE "plans" SET "plan_type" = $1, "updated_at" = $2 WHERE "plans"."id" = $3  [["plan_type", 1], ["updated_at", "2022-07-03 19:16:26.008696"], ["id", 1]]

    def set_plan
      @plan = Plan.find(params[:id])
---
SELECT "plans".* FROM "plans" WHERE "plans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]