app/controllers/admin/user_transactions_controller.rb

SELECT "user_transactions".* FROM "user_transactions"
---
  def index
    byebug
    @user_transactions = UserTransaction.all