app/controllers/authentication_controller.rb

  def login
    @user = User.find_by_email(params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@admin.com"], ["LIMIT", 1]]

  def register
    @user = User.new(registeration_params)
    unless registeration_params[:referral_code].blank?
      referrer = User.find_by(referral_code: registeration_params[:referral_code])
      if referrer.nil?
        render json: { errors: ["wrong code"] }, status: :unprocessable_entity
        return
      end
      @user.referrer = referrer
    end

    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."referral_code" = $1 LIMIT $2  [["referral_code", "afc6ed"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at", "referrer_id", "referral_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"