app/controllers/profiles_controller.rb

  def transactions
    per_page = params[:per_page] ? params[:per_page] : 10
    page = params[:page] ? params[:page] : 1

    items = current_user.user_transactions.paginate(page: page, per_page: per_page)
    total_items = items.size
---
SELECT COUNT(*) FROM "user_transactions" WHERE "user_transactions"."user_id" = $1  [["user_id", 6]]
SELECT "user_transactions".* FROM "user_transactions" WHERE "user_transactions"."user_id" = $1 LIMIT $2 OFFSET $3  [["user_id", 6], ["LIMIT", 10], ["OFFSET", 0]]