app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."referral_code" = $1 LIMIT $2  [["referral_code", "1234"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at", "referrer_id", "referral_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if user_params[:referral_code]
      referrer = User.find_by(referral_code: user_params[:referral_code])
      if referrer.nil?
        render json: { errors: ["wrong code"] }, status: :unprocessable_entity
        return
      end
      @user.referrer = referrer
    end

    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_user
    @user = User.find(params[:id])