app/models/referral_rate.rb

SELECT "referral_rates".* FROM "referral_rates" WHERE (referral_count <= 0) ORDER BY "referral_rates"."referral_count" DESC LIMIT $1  [["LIMIT", 1]]
---
  def self.rate_by_count(count)
    where('referral_count <= ?', count).first&.profit_rate