app/models/user.rb

  def active?
    return true if user_transactions.count.positive?
---
SELECT "users".* FROM "users"

  def generate_referral_code
    begin
      referral_code = SecureRandom.hex(3)
    end while User.exists?(referral_code: referral_code)
---
SELECT 1 AS one FROM "users" WHERE "users"."referral_code" = $1 LIMIT $2  [["referral_code", "a01528"], ["LIMIT", 1]]